---
title: WorksharingTooltipInfo
classe: Autodesk.Revit.DB.WorksharingTooltipInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# WorksharingTooltipInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Creator { get; }` | `worksharingTooltipInfo.Creator` | String |
| `Boolean IsValidObject { get; }` | `worksharingTooltipInfo.IsValidObject` | Boolean |
| `String LastChangedBy { get; }` | `worksharingTooltipInfo.LastChangedBy` | String |
| `String Owner { get; }` | `worksharingTooltipInfo.Owner` | String |
| `Void Dispose()` | `worksharingTooltipInfo.Dispose()` | Void |
| `IList<String> GetRequesters()` | `worksharingTooltipInfo.GetRequesters()` | IList<String> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```